controllers/BoticaController.php

INSERT INTO `botica` (`nomrazon`, `ruc`, `direccion`, `idclientecaja`, `idinventario`, `tipo_almacen`, `idcompped`, `create_by`, `update_by`) VALUES ('BOTICA NUEVA', '12345678912', 'Direccion cualquiera', 1, NULL, 0, 6, 4, 4)
---
    public function actionCreate($submit=false)
    {
        $model = new Botica();

        if (Yii::$app->request->isAjax && $model->load(Yii::$app->request->post()) && $submit == false) {
            Yii::$app->response->format = Response::FORMAT_JSON;
            return ActiveForm::validate($model);
        }

        if ($model->load(Yii::$app->request->post())) {

            $model->nomrazon=mb_strtoupper($model->nomrazon,'utf-8');
            if ($model->save()) {