controllers/SiteController.php

    public function actionIndex()
    {
        $model= new Panel();
        $ventas=new VentaSearch();
        $boticas=Botica::find()->where(['tipo_almacen'=>0])->all();
---
SELECT * FROM `botica` WHERE `tipo_almacen`=0