modules/api/controllers/DefaultController.php

SELECT * FROM `botica` WHERE `idbotica`='2'
---
    public function beforeAction($action){
        $header=Yii::$app->request->getHeaders();
        $before=parent::beforeAction($action);
        if($header->get('idbotica')==null){
            throw new HttpException(401,'Falta de informacion');
        }else{
            $this->idbotica=$header->get('idbotica');