modules/api/controllers/NotificadorController.php

    public function actionIndex()
    {

        $tablas=[
            [
                'tabla'=>'roles',
                'datos'=>Roles::find()->where('sincronizaciones is null')
                    ->orWhere(['not like','sincronizaciones','"botica":'.$this->idbotica])->all(),
                'icon'=>'fa fa-users',
            ],
            [
                'tabla'=>'usuarios',
                'datos'=>Usuarios::find()->where('sincronizaciones is null')
                    ->orWhere(['not like','sincronizaciones','"botica":'.$this->idbotica])->all(),
                'icon'=>'fa fa-user',
            ],
            [
                'tabla'=>'clientes',
                'datos'=>Clientes::find()->where('sincronizaciones is null')
                    ->orWhere(['not like','sincronizaciones','"botica":'.$this->idbotica])->all(),
                'icon'=>'fa fa-user-o',
            ],
            [
                'tabla'=>'comprobantes',
                'datos'=>Comprobante::find()->where('sincronizaciones is null')
                    ->orWhere(['not like','sincronizaciones','"botica":'.$this->idbotica])->all(),
                'icon'=>'fa fa-book',
            ],
            [
                'tabla'=>'categorias',
                'datos'=>Categorias::find()->where('sincronizaciones is null')
                    ->orWhere(['not like','sincronizaciones','"botica":'.$this->idbotica])->all(),
---
SELECT * FROM `roles` WHERE (sincronizaciones is null) OR (`sincronizaciones` NOT LIKE '%\"botica\":3%')
SELECT * FROM `usuarios` WHERE (sincronizaciones is null) OR (`sincronizaciones` NOT LIKE '%\"botica\":3%')
SELECT * FROM `clientes` WHERE (sincronizaciones is null) OR (`sincronizaciones` NOT LIKE '%\"botica\":3%')
SELECT * FROM `comprobante` WHERE (sincronizaciones is null) OR (`sincronizaciones` NOT LIKE '%\"botica\":3%')
SELECT * FROM `categorias` WHERE (sincronizaciones is null) OR (`sincronizaciones` NOT LIKE '%\"botica\":3%')

            ],
            [
                'tabla'=>'laboratorios',
                'datos'=>Laboratorio::find()->where('sincronizaciones is null')
                    ->orWhere(['not like','sincronizaciones','"botica":'.$this->idbotica])->all(),
---
SELECT * FROM `laboratorio` WHERE (sincronizaciones is null) OR (`sincronizaciones` NOT LIKE '%\"botica\":3%')

            ],
            [
                'tabla'=>'productos',
                'datos'=>Productos::find()->where('sincronizaciones is null')
                    ->orWhere(['not like','sincronizaciones','"botica":'.$this->idbotica])->all(),
---
SELECT * FROM `productos` WHERE (sincronizaciones is null) OR (`sincronizaciones` NOT LIKE '%\"botica\":3%')

            ],
            [
                'tabla'=>'unidades',
                'datos'=>Unidades::find()->where('sincronizaciones is null')
                    ->orWhere(['not like','sincronizaciones','"botica":'.$this->idbotica])->all(),
---
SELECT * FROM `unidades` WHERE (sincronizaciones is null) OR (`sincronizaciones` NOT LIKE '%\"botica\":3%')

            ],
            [
                'tabla'=>'sugerencias',
                'datos'=>Sugerencia::find()->where('sincronizaciones is null')
                    ->orWhere(['not like','sincronizaciones','"botica":'.$this->idbotica])->all(),
---
SELECT * FROM `sugerencia` WHERE (sincronizaciones is null) OR (`sincronizaciones` NOT LIKE '%\"botica\":3%')

            ],
            [
                'tabla'=>'movimientos',
                'datos'=>MovimientoStock::find()
                    ->where('idbotica='.$this->idbotica.' AND idlocal is null')->all(),
---
SELECT * FROM `movimiento_stock` WHERE idbotica=3 AND idlocal is null

            ],
            [
                'tabla'=>'transfxrecibir',
                'datos'=>Transferencia::find()->where([
                    'destino_conf'=>0,'estado'=>'E','idbotdestino'=>$this->idbotica
                ])->all(),
---
SELECT * FROM `transferencia` WHERE (`destino_conf`=0) AND (`estado`='E') AND (`idbotdestino`='3')

            ],
            [
                'tabla'=>'transfxfinalizar',
                'datos'=>Transferencia::find()->where([
                    'origen_conf'=>0,'estado'=>'F','idbotorigen'=>$this->idbotica
                ])->all(),
---
SELECT * FROM `transferencia` WHERE (`origen_conf`=0) AND (`estado`='F') AND (`idbotorigen`='3')