models/Botica.php

	public function getCboclicaja() {
		return ArrayHelper::map(Clientes::find()->where(['cajarapida' => 1])->asArray()->all(),
			'idcliente', 'nomcliente');
---
SELECT * FROM `clientes` WHERE `cajarapida`=1

	public function getCboprovinv() {
		return ArrayHelper::map(Proveedores::find()->where(['inventario' => 1])->asArray()->all(),
			'idcliente', 'nomproveedor');
---
SELECT * FROM `proveedores` WHERE `inventario`=1

	public function getCbocomprobante() {
		return ArrayHelper::map(Comprobante::find()->where(['tipoventa' => 1])->asArray()->all(),
			'idcomprobante', 'descripcion');
---
SELECT * FROM `comprobante` WHERE `tipoventa`=1