models/Panel.php

    public function getInfo(){
        $boticas=Botica::find()->count();
        $usuarios=Usuarios::find()->count();
        $productos=Productos::find()->count();
        $categorias=Categorias::find()->count();
        $laboratorios=Laboratorio::find()->count();
---
SELECT COUNT(*) FROM `botica`
SELECT COUNT(*) FROM `usuarios`
SELECT COUNT(*) FROM `productos`
SELECT COUNT(*) FROM `categorias`
SELECT COUNT(*) FROM `laboratorio`