models/Usuarios.php

    public static function findIdentity($id)
    {
        return static::findOne(['idusuario' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `usuarios` WHERE (`idusuario`=4) AND (`status`=10)

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token]);
---
SELECT * FROM `usuarios` WHERE `auth_key`='lv_oAFu_8eE4ss1YWr--nsLiUwOEqLN7'