models/VentaSearch.php

SELECT DISTINCT YEAR(salida.create_at) AS anio, MONTH(salida.create_at) AS mes FROM `salida` INNER JOIN `pedidos` ON salida.idpedido = pedidos.idpedido WHERE `salida`.`idbotica`=2 GROUP BY `anio`, `mes` ORDER BY `anio` DESC, `mes` DESC LIMIT 12
SELECT DISTINCT SUM(total) AS total, YEAR(salida.create_at) AS anio, MONTH(salida.create_at) AS mes FROM `salida` INNER JOIN `pedidos` ON salida.idpedido = pedidos.idpedido WHERE (MONTH(salida.create_at)='1') AND (`salida`.`idbotica`=2) AND (YEAR(salida.create_at)='2017') GROUP BY `mes`, `anio`
SELECT DISTINCT DAY(salida.create_at) AS dia, SUM(total) AS total FROM `salida` INNER JOIN `pedidos` ON salida.idpedido = pedidos.idpedido WHERE (MONTH(salida.create_at)='1') AND (`salida`.`idbotica`=2) AND (YEAR(salida.create_at)='2017') GROUP BY `dia`
---
    public function dataGrafVMxBotica($idbotica,$all=false){
        if($all){
            $qc=Salida::find()->distinct()->select([
                'YEAR(salida.create_at) AS anio',
                'MONTH(salida.create_at) AS mes'
            ])->innerJoin('pedidos', 'salida.idpedido = pedidos.idpedido')
                ->where(['salida.idbotica'=>$idbotica])
                ->groupBy('anio, mes')->orderBy(['anio'=>SORT_DESC,'mes'=>SORT_DESC])
                ->asArray()->all();
        }else{
            $qc=Salida::find()->distinct()->select([
                'YEAR(salida.create_at) AS anio',
                'MONTH(salida.create_at) AS mes'
            ])->innerJoin('pedidos', 'salida.idpedido = pedidos.idpedido')
                ->where(['salida.idbotica'=>$idbotica])
                ->groupBy('anio, mes')->orderBy(['anio'=>SORT_DESC,'mes'=>SORT_DESC])
                ->limit(12)->asArray()->all();
        }

        $qc= array_reverse($qc);
        $total=[];
        $drilldown=[];
        $cat=[];
        foreach ($qc as $c){
            $cat[]=Funciones::nomMes($c['mes']).' DEL '.$c['anio'];
            $qt=Salida::find()->distinct()->select([
                'SUM(total) AS total',
                'YEAR(salida.create_at) AS anio',
                'MONTH(salida.create_at) AS mes'
            ])->innerJoin('pedidos', 'salida.idpedido = pedidos.idpedido')
                ->where([
                    'MONTH(salida.create_at)'=>$c['mes'],
                    'salida.idbotica'=>$idbotica,
                    'YEAR(salida.create_at)'=>$c['anio']
                ])->groupBy('mes, anio')->asArray()->one();
            $qd=Salida::find()->distinct()->select([
                'DAY(salida.create_at) AS dia',
                'SUM(total) AS total',
            ])->innerJoin('pedidos', 'salida.idpedido = pedidos.idpedido')
                ->where([
                    'MONTH(salida.create_at)'=>$c['mes'],
                    'salida.idbotica'=>$idbotica,
                    'YEAR(salida.create_at)'=>$c['anio']
                ])->groupBy('dia')->asArray()->all();

SELECT DISTINCT YEAR(salida.create_at) AS anio, MONTH(salida.create_at) AS mes FROM `salida` INNER JOIN `pedidos` ON salida.idpedido = pedidos.idpedido GROUP BY `anio`, `mes` ORDER BY `anio` DESC, `mes` DESC LIMIT 12
SELECT DISTINCT `usuarios`.`username` AS `usuario`, SUM(total) AS total FROM `salida` INNER JOIN `pedidos` ON salida.idpedido = pedidos.idpedido INNER JOIN `usuarios` ON usuarios.idusuario = salida.create_by WHERE (MONTH(salida.create_at)='1') AND (YEAR(salida.create_at)='2017') GROUP BY `usuario`
---
    public function dataVentasxVendedor(){
        $qc=Salida::find()->distinct()->select([
            'YEAR(salida.create_at) AS anio',
            'MONTH(salida.create_at) AS mes'
        ])->innerJoin('pedidos', 'salida.idpedido = pedidos.idpedido')
            ->groupBy('anio, mes')->orderBy(['anio'=>SORT_DESC,'mes'=>SORT_DESC])
            ->limit(12)->asArray()->all();
        $qc=array_reverse($qc);
        $total=[];
        $drilldown=[];
        $cat=[];
        foreach ($qc as $c) {
            $cat[] = Funciones::nomMes($c['mes']) . ' DEL ' . $c['anio'];
            $qt=Salida::find()->distinct()->select([
                'SUM(total) AS total',
                'YEAR(salida.create_at) AS anio',
                'MONTH(salida.create_at) AS mes'
            ])->innerJoin('pedidos', 'salida.idpedido = pedidos.idpedido')

                ->where([
                    'MONTH(salida.create_at)'=>$c['mes'],
                    'YEAR(salida.create_at)'=>$c['anio']
                ])->groupBy('mes, anio')->asArray()->one();
            $qu=Salida::find()->distinct()->select([
                'usuarios.username AS usuario',
                'SUM(total) AS total',
            ])->innerJoin('pedidos', 'salida.idpedido = pedidos.idpedido')
                ->innerJoin('usuarios','usuarios.idusuario = salida.create_by')
                ->where([
                    'MONTH(salida.create_at)'=>$c['mes'],
                    'YEAR(salida.create_at)'=>$c['anio']
                ])->groupBy('usuario')->asArray()->all();